{
  "1": {
    "img": "./assets/images/abstract.jpeg",
    "thumbnail": "./assets/images/abstract-small.jpeg",
    "title": "Abstract art can tell a story—and look good too",
    "shortText": "The exhibition On Documentary Abstraction, now on view at the Art Center/South Florida (until 2 January), sounds, perhaps, like a contradiction in terms. But the New York-based art critic and independent curator Rachael Rakes has brought together four contemporary artists to show the sense of it. The exhibition features work by Torkwase Dyson, Tomashi Jackson, and the Canadian duo Richard Ibghy and Marilou Lemmens, who all practice forms of abstraction to address issues such as history, race and economics.",
    "urlToNews": "/Abstract-art-can-tell-a-story—and-look-good-too/"
  },
  "2": {
    "img": "./assets/images/chair-design.jpeg",
    "thumbnail": "./assets/images/chair-design-small.jpeg",
    "title": "Haima' armchair by Maryam Al Suwaidi for FROMM",
    "shortText": "Qatari designer Maryam Al Suwaidi looked to the shape of sand dunes when creating the cocooning Haima' armchair and its matching pouf for local design brand FROMM.\n\nLaunched at this year's Milan design week, the Haima' armchair is characterised by its curved shell, which is made from plywood and combines layers of Italian Tabu veneer with poplar wood.\n\n",
    "urlToNews": "/Haima'-armchair-by-Maryam-Al-Suwaidi-for-FROMM/"
  },
  "3": {
    "img": "./assets/images/comic.jpeg",
    "thumbnail": "./assets/images/comic-small.jpeg",
    "title": "Namor The Sub-Mariner's New Series Leads A Massive Week Of New Marvel Releases",
    "shortText": "With the Black Panther sequel set to come out in November, Marvel Comics is debuting two new miniseries this week -- Namor the Sub-Mariner and Wakanda -- both of which will be five-issues long. Namor is written by Iron Man scribe Christopher Cantwell with art by Pasqual Ferry, and the book will explore the character a century into a perilous future, serving as the ruler of the entire Earth. Meanwhile, Wakanda #1 is by writers Evan Narcisse, Stephanie Williams, artists Paco Medina and Natacha Bustos, and will delve into the history of the African nation and spotlight T'Challa's sister, Shuri.",
    "urlToNews": "Namor-The-Sub-Mariner's-New-Series-Leads-A-Massive-Week-Of-New-Marvel-Releases"
  },
  "4": {
    "img": "./assets/images/drawing.jpeg",
    "thumbnail": "./assets/images/drawing-small.jpeg",
    "title": "$640 million Powerball drawing up next as big jackpots grow",
    "shortText": "DES MOINES, Iowa (AP) — Lottery players have another chance to win big next week since there were no winners of the top prize for both the Powerball and Mega Millions jackpots in their most recent drawings.\n\nThe Powerball jackpot grew to an estimated $730 million after no one matched all five numbers and the red ball in the drawing on Saturday night. If a lottery player strikes big in the next Powerball drawing on Wednesday, it would be the fifth-largest jackpot ever in the United States.",
    "urlToNews": "$640-million-Powerball-drawing-up-next-as-big-jackpots-grow"
  },
  "5": {
    "img": "./assets/images/mosaic.jpeg",
    "thumbnail": "./assets/images/mosaic-small.jpeg",
    "title": "Mosaic (MOS) Stock Moves -1.49%: What You Should Know",
    "shortText": "In the latest trading session, Mosaic (MOS) closed at $54.31, marking a -1.02% move from the previous day. This change was narrower than the S&P 500's 1.13% loss on the day. Meanwhile, the Dow lost 1.01%, and the Nasdaq, a tech-heavy index, lost 0.18%.",
    "urlToNews": "Mosaic-(MOS)-Stock-Moves-1.49%:-What-You-Should-Know"
  },
  "6": {
    "img": "./assets/images/sculpture.jpeg",
    "thumbnail": "./assets/images/sculpture-small.jpeg",
    "title": "This Giant Hand Sculpture With a Menacing Face Is Freaking People Out",
    "shortText": "I ask the good people of cyberspace, why do we Art? What compelled Pollock to splatter, Warhol to pop, Frida to selfie? All of the greatest artists in history would probably tell you that inspiration comes from some power outside of the self; ideas travel down to the brain, through the arms, and out of the hand in movements of divine passion. And it can happen, albeit rarely, that the thing coming out of the hand is... another hand. In the case of a recent sculpture installation in Wellington, New Zealand, this hand stands about 15ft tall on a roof with a menacing facial expression.",
    "urlToNews": "This-Giant-Hand-Sculpture-With-a-Menacing-Face-Is-Freaking-People-Ou"
  },
  "7": {
    "img": "./assets/images/social.jpeg",
    "thumbnail": "./assets/images/social-small.jpeg",
    "title": "Who Really Benefits from the Creator Economy?",
    "shortText": "The Creator Economy has become a much bigger focus over the last few years, with the rise of TikTok sparking a new battle amongst the social platforms to maximize their creator appeal, in order to keep popular users posting to their apps.",
    "urlToNews": "Who-Really-Benefits-from-the-Creator-Economy?"
  },
  "8": {
    "img": "./assets/images/street.jpeg",
    "thumbnail": "./assets/images/street-small.jpe",
    "title": "Latest Lisbon News",
    "shortText": "Gibraltar to call Estádio do Algarve home yet again Gibraltar’s national football team will be playing its home Euro 2024 qualification matches at Estádio do Algarve (Algarve Stadium) in Faro. The news was confirmed today by the Gibraltar Football Association (GFA). This will mark the team’s return to the Algarve, where it...",
    "urlToNews": "Latest-Lisbon-News"
  },
  "9": {
    "img": "./assets/images/tree.jpeg",
    "thumbnail": "./assets/images/tree-small.jpeg",
    "title": "Trees’ Scent Tricks Hornets Into Shuttling Seeds",
    "shortText": "The work, published today (June 30) in Current Biology, describes how the agarwood’s fruit mimic the odors released when the insects start feasting on agarwood leaves. The hornets are lured in by these odors to prey on the insects but encounter a seed instead. ",
    "urlToNews": "Trees’-Scent-Tricks-Hornets-Into-Shuttling-Seeds"
  },
  "10": {
    "img": "./assets/images/toronto.jpeg",
    "thumbnail": "./assets/images/toronto-small.jpeg",
    "title": "Prism of Relations: the 2022 Toronto Biennial",
    "shortText": "The second edition of the Toronto Biennial of Art - What Water Knows, The Land Remembers - revisited the history of Toronto to underscore the importance of remembrance. The title What Water Knows, The Land Remembers is a continuation of what began with the first edition, The Shoreline Dilemma, but this time it expanded the horizon to view the city as a living personification of the natural world, indigenous wisdom and colonial history. ",
    "urlToNews": "Prism-of-Relations:-the-2022-Toronto-Biennial"
  },
  "11": {
    "img": "./assets/images/mexico.jpeg",
    "thumbnail": "./assets/images/mexico-small.jpeg",
    "title": "Mexico's Best-Kept Secret Is Zacatecas’s Vibrant Art Scene",
    "shortText": "It all coalesces to lend the Mexican city of Zacatecas that vital yet mysterious attitude that invites introspection, inspiration, and creation. This being the case, it should come as no surprise that there is an abundance of impressive artistic offerings in this small city in central Mexico. Few outsiders, however, are aware of them.",
    "urlToNews": "Mexico's-Best-Kept-Secret-Is-Zacatecas’s-Vibrant-Art-Scene"
  },
  "12": {
    "img": "./assets/images/abstract-painter.jpeg",
    "thumbnail": "./assets/images/abstract-painter-small.jpeg",
    "title": "Mary Obering, Abstract Painter With a Passionate Following, Dies at 85",
    "shortText": "Mary Obering, a painter whose geometric abstractions brought her a small but loyal following, has died at 85. New York’s Bortolami gallery, which added her to its roster in 2019, said that Obering died in New York of natural causes on July 29.",
    "urlToNews": "Mary-Obering,-Abstract-Painter-With-a-Passionate-Following,-Dies-at-85"
  },
  "13": {
    "img": "./assets/images/archeology.jpeg",
    "thumbnail": "./assets/images/archeology-small.jpeg",
    "title": "Archaelogists Discovered 800-Year-Old Ancient Palace That May Have Belonged To Genghis Khan's Grandson",
    "shortText": "Archaelogists discovered the remains of an ancient palace that may have belonged to Genghis Khan’s grandson Hulagu Khan in the Çaldıran district of eastern Turkey’s Van province. Excavations at the site are currently ongoing.",
    "urlToNews": "Archaelogists-Discovered-800-Year-Old-Ancient-Palace-That-May-Have-Belonged-To-Genghis-Khan's-Grandson"
  }
}