[
  {
    "img": "./assets/images/abstract.jpeg",
    "thumbnail": "./assets/images/abstract-small.jpeg",
    "title": "Abstract art can tell a story—and look good too",
    "shortText": "The exhibition On Documentary Abstraction, now on view at the Art Center/South Florida (until 2 January), sounds, perhaps, like a contradiction in terms. But the New York-based art critic and independent curator Rachael Rakes has brought together four contemporary artists to show the sense of it. The exhibition features work by Torkwase Dyson, Tomashi Jackson, and the Canadian duo Richard Ibghy and Marilou Lemmens, who all practice forms of abstraction to address issues such as history, race and economics.",
    "slug": "abstract-art-can-tell-a-story—and-look-good-too",
    "text": "The exhibition On Documentary Abstraction, now on view at the Art Center/South Florida (until 2 January), sounds, perhaps, like a contradiction in terms. But the New York-based art critic and independent curator Rachael Rakes has brought together four contemporary artists to show the sense of it. The exhibition features work by Torkwase Dyson, Tomashi Jackson, and the Canadian duo Richard Ibghy and Marilou Lemmens, who all practice forms of abstraction to address issues such as history, race and economics.\n\nWhile researching documentary film and social practice art from the 1990s and early 2000s, Rakes wondered: “What would a non-figurative documentary look like? How do you do that?” As she emphasises in a short essay published to complement the show: “Documentary has never been real, and has, from its beginning, been a form of art.” A truism by now, the fact nevertheless bears repeating, since it opens the door to the possibility for non-pictorial documentary art.\n\nIn 2016, Rakes saw “the articulation of what I had been trying to think about” in the work of Dyson. The artist produces immersive black paintings and sculptures that carry within their ravishing surfaces the lasting pain of slavery and racism. She is among a wave of artists today who thwart the sometimes counterproductive tendency to directly illustrate black suffering. “If you obstruct the information and communicate it differently, if you show it differently through spatial abstraction, it might have more of an impact,” Rakes says.\n\nRakes also explains that the notion that abstraction is somehow inconsistent with social engagement—something that was fiercely debated in the 1960s and 70s during the Civil Rights Movement—derives, in part, from the Modernist critic Clement Greenberg, who famously insisted upon that separation.\n\n“This conceptualisation ultimately ignored centuries of abstract and formalist practices from around the world,” Rakes writes in her essay. “It also disregarded Modern Abstractionists’ own acknowledgement of visual and contextual references outside of their own field.”\n\n"
  },
  {
  "img": "./assets/images/chair-design.jpeg",
  "thumbnail": "./assets/images/chair-design-small.jpeg",
  "title": "Haima' armchair by Maryam Al Suwaidi for FROMM",
  "shortText": "Qatari designer Maryam Al Suwaidi looked to the shape of sand dunes when creating the cocooning Haima' armchair and its matching pouf for local design brand FROMM.\n\nLaunched at this year's Milan design week, the Haima' armchair is characterised by its curved shell, which is made from plywood and combines layers of Italian Tabu veneer with poplar wood.\n\n",
  "slug": "haima-armchair-by-maryam-al-suwaidi-for-fromm",
  "text": "The earliest records of chairs appear in Egyptian tomb paintings and ancient Greek art. The oldest representation Rybczynski could find is a Greek sculpture from 3,000 B.C., which is now in the Metropolitan Museum of Art. (You can see it right here.) It shows a harpist sitting on a simple, four-legged chair. \"We would call it a kitchen chair,\" says Rybczynski.\n\n\"The striking thing about the Greeks,\" Rybczynski explains, \"is that the chairs become very democratic very quickly.\"\n\nJust take a look at the pictures — \"there are women in chairs, gods in chairs, musicians — so it clearly was a tool used by many people,\" he says.\n\nBut democratic sitting didn't last. Fast forward to Europe in the Middle Ages and most people didn't get chairs at all. \"They just sat on whatever was around because they couldn't afford it,\" Rybczynski says. \"You had to be really rich to afford something like a chair. If they were lucky they sat on a bench — that was about the height of sitting.\"\n\n\nMichael Thonet , the German-Austrian furniture maker who made this cafe chair, also simplified the process of bending wood.\nWitold Rybczynski\nA chair's body has just a handful of parts: Legs, sometimes arms, a seat and a back. It may sound simple, but it's not. \"They're like little buildings, in a way, because they have to be beautiful but they have to be practical,\" Rybczynski says. \"They actually have to be very structurally sound.\"\n\nIn his book, Rybczynski writes of the many different architects and designers who've helped shape the history of the chair. In the 1830s German-Austrian furniture maker Michael Thonet invented the Vienna chair — you've probably seen those at coffee shops and cafes. Thonet simplified the process of bending wood, Rybczynski said, and turned the craft of chair-making into an industry.\n\nHe also celebrates the work of husband and wife team Charles and Ray Eames who began designing chairs in the 1940s. They designed shiny, smooth shells made of wood or a kind of plastic used in the linings of army helmets. \"The object was to take a material which was a high performance material developed during the war, and try to make it available to householders at non-military prices,\" Eames explained in a 1956 NBC interview.\n\nThe Eames revolutionized chair production. From airports to offices, they came up with designs that were innovative and lent themselves to mass production. \"They moved furniture from the traditional appearance to something very modern,\" says Rybczynski. Using materials like metal and plywood, they created chairs that remain popular today.\n\n"
},
  {
  "img": "./assets/images/comic.jpeg",
  "thumbnail": "./assets/images/comic-small.jpeg",
  "title": "Namor The Sub-Mariner's New Series Leads A Massive Week Of New Marvel Releases",
  "shortText": "With the Black Panther sequel set to come out in November, Marvel Comics is debuting two new miniseries this week -- Namor the Sub-Mariner and Wakanda -- both of which will be five-issues long. Namor is written by Iron Man scribe Christopher Cantwell with art by Pasqual Ferry, and the book will explore the character a century into a perilous future, serving as the ruler of the entire Earth. Meanwhile, Wakanda #1 is by writers Evan Narcisse, Stephanie Williams, artists Paco Medina and Natacha Bustos, and will delve into the history of the African nation and spotlight T'Challa's sister, Shuri.",
  "slug": "namor-the-sub-mariner-s-new-series-leads-a-massive-week-of-new-marvel-releases",
  "text": "Marvel is debuting two new collection for Wakanda’s heroes and Namor forward of the discharge of Black Panther: Wakanda Forever.\n\n\nWith the Black Panther sequel set to come back out in November, Marvel Comics is debuting two new miniseries this week — Namor the Sub-Mariner and Wakanda — each of which might be five-issues lengthy. Namor is written by Iron Man scribe Christopher Cantwell with artwork by Pasqual Ferry, and the e book will discover the character a century into a dangerous future, serving because the ruler of your entire Earth. Meanwhile, Wakanda is by writers Evan Narcisse, Stephanie Williams, artists Paco Medina and Natacha Bustos, and can delve into the historical past of the African nation and highlight T’Challa’s sister, Shuri.\n\nRELATED: The Avengers’ Biggest Story Ever Begins, Spider-Man’s Evil Clone Returns in November’s Solicits\n\nThere are additionally just a few #1’s hitting retailer cabinets and digital platforms on Wednesday. A.X.E.: Eternals #1 and A.X.E.: Iron Fist #1 launch as new tie-ins to the A.X.E.: Judgment Day crossover occasion, although the Iron Fist difficulty will proceed Lin Lie’s journey from the 2022 Iron Fist miniseries by author Alyssa Wong and artist Michael YG. There can be the discharge of Punisher War Journal: Brother #1, the beginning of a brand new Star Wars: The High Republic collection and the comedian e book adaptation and continuation of Disney+’s Star Wars: Visions.\n\nReaders can even choose up Fantastic Four #48, — the ultimate difficulty of the collection — and look out for the debut of “Sleeper Agent” in Venom #11. Wolverine is reaching its twenty fifth difficulty, and Peter Parker is as soon as once more preventing the Hob-Goblin in The Amazing Spider-Man, although who’s donning the masks stays to be seen. The full checklist of releases might be discovered alphabetically beneath, covers and solicitations included."
},
  {
  "img": "./assets/images/drawing.jpeg",
  "thumbnail": "./assets/images/drawing-small.jpeg",
  "title": "$640 million Powerball drawing up next as big jackpots grow",
  "shortText": "DES MOINES, Iowa (AP) — Lottery players have another chance to win big next week since there were no winners of the top prize for both the Powerball and Mega Millions jackpots in their most recent drawings.\n\nThe Powerball jackpot grew to an estimated $730 million after no one matched all five numbers and the red ball in the drawing on Saturday night. If a lottery player strikes big in the next Powerball drawing on Wednesday, it would be the fifth-largest jackpot ever in the United States.",
  "slug": "million-powerball-drawing-up-next-as-big-jackpots-grow",
  "text": "DES MOINES, Iowa (AP) — Lottery players have another chance to win big next week since there were no winners of the top prize for both the Powerball and Mega Millions jackpots in their most recent drawings.\n\nThe Powerball jackpot grew to an estimated $730 million after no one matched all five numbers and the red ball in the drawing on Saturday night. If a lottery player strikes big in the next Powerball drawing on Wednesday, it would be the fifth-largest jackpot ever in the United States.\n\nThe winning numbers were 67, 20, 65, 14, 39, and the Powerball was 02.\n\nNo one beat the odds in Friday's Mega Millions drawing, so that jackpot grew to an estimated $850 million. That would be the third-largest jackpot ever if there's a winner of the top prize for the drawing on Tuesday.\n\nIt's been nearly two years since a lottery jackpot has grown so large. No one has won either game’s top prize in months.\n\nThe listed jackpot amounts refer to winners who opt for an annuity, paid over 30 years. Winners nearly always choose cash prizes, which for Powerball would be $546 million. The estimated cash prize for the next Mega Millions jackpot is $628.2 million.\n\nMega Millions and Powerball are both played in 45 states as well as Washington, D.C., and the U.S. Virgin Islands. Powerball also is offered in Puerto Rico.\n\nCopyright 2021 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission."
},
  {
  "img": "./assets/images/mosaic.jpeg",
  "thumbnail": "./assets/images/mosaic-small.jpeg",
  "title": "Mosaic (MOS) Stock Moves -1.49%: What You Should Know",
  "shortText": "In the latest trading session, Mosaic (MOS) closed at $54.31, marking a -1.02% move from the previous day. This change was narrower than the S&P 500's 1.13% loss on the day. Meanwhile, the Dow lost 1.01%, and the Nasdaq, a tech-heavy index, lost 0.18%.",
  "slug": "mosaic-mos-stock-moves-what-you-should-know",
  "text": "In the latest trading session, Mosaic (MOS) closed at $54.31, marking a -1.02% move from the previous day. This change was narrower than the S&P 500's 1.13% loss on the day. Meanwhile, the Dow lost 1.01%, and the Nasdaq, a tech-heavy index, lost 0.18%.\n\nComing into today, shares of the fertilizer maker had lost 0.89% in the past month. In that same time, the Basic Materials sector lost 3.12%, while the S&P 500 lost 7.59%.\n\nMosaic will be looking to display strength as it nears its next earnings release. On that day, Mosaic is projected to report earnings of $3.70 per share, which would represent year-over-year growth of 174.07%. Our most recent consensus estimate is calling for quarterly revenue of $6.36 billion, up 86.04% from the year-ago period.\n\nMOS's full-year Zacks Consensus Estimates are calling for earnings of $13.62 per share and revenue of $21.34 billion. These results would represent year-over-year changes of +170.24% and +72.68%, respectively.\n\nAny recent changes to analyst estimates for Mosaic should also be noted by investors. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. Investors can capitalize on this by using the Zacks Rank. This model considers these estimate changes and provides a simple, actionable rating system.\n\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. Mosaic currently has a Zacks Rank of #3 (Hold).\n\nIn terms of valuation, Mosaic is currently trading at a Forward P/E ratio of 4.03. For comparison, its industry has an average Forward P/E of 5.4, which means Mosaic is trading at a discount to the group.\n\n"
},
  {
  "img": "./assets/images/sculpture.jpeg",
  "thumbnail": "./assets/images/sculpture-small.jpeg",
  "title": "This Giant Hand Sculpture With a Menacing Face Is Freaking People Out",
  "shortText": "I ask the good people of cyberspace, why do we Art? What compelled Pollock to splatter, Warhol to pop, Frida to selfie? All of the greatest artists in history would probably tell you that inspiration comes from some power outside of the self; ideas travel down to the brain, through the arms, and out of the hand in movements of divine passion. And it can happen, albeit rarely, that the thing coming out of the hand is... another hand. In the case of a recent sculpture installation in Wellington, New Zealand, this hand stands about 15ft tall on a roof with a menacing facial expression.",
  "slug": "this-giant-hand-sculpture-with-a-menacing-face-is-freaking-people-ou",
  "text": "Chronologically, “disability studies” emerged in the mid-to-late 1980s, and “body art” was established as a category of contemporary art in the 1970s, but disabled bodies occur in art dating to at least the 1st century CE. Still, a class on the disabled body might come quite late in the semester, after looking at other issues of identity, such as race, ethnicity, and gender. A lecture on “Disability in Art” can be a good opportunity to reflect on a central narrative of art history—representation of the human figure—and to reflect on the ways in which art contributes to and challenges the construction of normative culture. Disability studies offers an alternative methodology and point of departure for the study of the body in art history.\n\nConsider past material covered with the class—how has the body, both abled and disabled, appeared within the course? Why do we tend to ignore the disabled bodies that appear in works such as Velázquez’s Las Meninas (1656)? How much have we learned about the lives and impact of people with disabilities throughout history? Why might that be?\n\nAbleism is defined in disability studies as discrimination in favor of able-bodied people. The ableist views able bodies as the norm in society, implying that people who have disabled bodies must strive to become that norm. Disability is thus held as an error, a mistake, or a failing, rather than a simple consequence of human diversity; disability is seen as a “bad” thing that must be overcome. Use this definition to prompt a discussion about the ways ability bias has impacted art making and the ways it can affect our understanding of history. Ask students to take a few minutes in groups to answer the above questions, referring to concrete examples from the course, before coming back together as a class. As a group, try to compile a list of works that include representations of disability. Consider the biases of historians who often believe that their criteria of what is important is universal, without recognizing how their judgment is shaped by the particularities of their privileged positions."
},
  {
  "img": "./assets/images/social.jpeg",
  "thumbnail": "./assets/images/social-small.jpeg",
  "title": "Who Really Benefits from the Creator Economy?",
  "shortText": "The Creator Economy has become a much bigger focus over the last few years, with the rise of TikTok sparking a new battle amongst the social platforms to maximize their creator appeal, in order to keep popular users posting to their apps.",
  "slug": "who-really-benefits-from-the-creator-economy",
  "text": "The Creator Economy has become a much bigger focus over the last few years, with the rise of TikTok sparking a new battle amongst the social platforms to maximize their creator appeal, in order to keep popular users posting to their apps.\n\nWhich makes sense. Vine, which many view as the precursor to TikTok, eventually died out because parent company Twitter couldn’t establish an effective revenue share model for short clips, a key challenge of the format. If TikTok can’t get creators paid, they won’t stick around, which both YouTube and Instagram see as an opportunity to mitigate TikTok’s growth.\n\nCombine that with the increasing work from home push, which has seen more people reassessing how they make money, and indeed, whether they could possibly get paid for the content that they post online, and you can see how the platforms view this as a key opportunity to win over more creators, and keep them posting to their apps – while ideally, fending off rising competition.\n\nIt all connects up, and for social platforms battling for audience attention, it’s a perfect scenario for them to also lure the most entertaining users to post more often, in order to prop-up their engagement stats.\n\nBut there’s one core, essential truth of the creator economy that undercuts the emphasis and enthusiasm in the space: Most people are simply not good enough at being entertaining, on a consistent basis, to make any real money out of being an online creator.\n\nThe stats tell the tale – according to a recent survey conducted by influencer marketing platform Aspire, which incorporates feedback from over 1,700 creators, only 4.3% of them are earning six figures or more per year from their online posts.\n\nWhich, really, makes sense. Sure, there are the Mr. Beasts of the world – who recently turned down a billion dollar offer for his YouTube channel. But off the top of your head, how many top online creators can you actually name?\n\nPewDiePie, Dream, the DÁmelio sisters. You likely have your own, more niche favorites as well, but I’m guessing that list starts to thin out pretty quick.\n\nOne consideration here is that there’s a limit to how much content we can take in. That means that while some of the top stars are seeing millions of views, and occupying hours and hours of people’s time, that also then further reduces the amount of time left for other creators – which means that, realistically, there’s not enough capacity to support an infinite number of creators in an infinite number of niches.  \n\nBut the real truth is that being a successful creator is hard."
},
  {
  "img": "./assets/images/street.jpeg",
  "thumbnail": "./assets/images/street-small.jpe",
  "title": "Latest Lisbon News",
  "shortText": "Gibraltar to call Estádio do Algarve home yet again Gibraltar’s national football team will be playing its home Euro 2024 qualification matches at Estádio do Algarve (Algarve Stadium) in Faro. The news was confirmed today by the Gibraltar Football Association (GFA). This will mark the team’s return to the Algarve, where it...",
  "slug": "latest-lisbon-news",
  "text": "Includes mayors from all possible locations With the future of flagship airline TAP still very much up in the air, the government has finally launched the commission to decide where Lisbon’s new airport will be sited. It’s a question that MPs and those in the airline sector constantly remind us has...Includes mayors from all possible locations With the future of flagship airline TAP still very much up in the air, the government has finally launched the commission to decide where Lisbon’s new airport will be sited. It’s a question that MPs and those in the airline sector constantly remind us has..."
},
  {
  "img": "./assets/images/tree.jpeg",
  "thumbnail": "./assets/images/tree-small.jpeg",
  "title": "Trees’ Scent Tricks Hornets Into Shuttling Seeds",
  "shortText": "The work, published today (June 30) in Current Biology, describes how the agarwood’s fruit mimic the odors released when the insects start feasting on agarwood leaves. The hornets are lured in by these odors to prey on the insects but encounter a seed instead. ",
  "slug": "trees-scent-tricks-hornets-into-shuttling-seeds",
  "text": "S. tuberosa uses vespicochory – the plant convinces hornets to grab its seeds and fly away with them. The hornets eventually drop the seeds, dispersing them in the process. Gao and his colleagues wanted to find out why the hornets were so eager to attack the seeds and carry them off; what visual, olfactory (smell) or gustatory (taste) cues did the hornets find so alluring?\n\nIn their paper recently published in New Phytologist, Gao and his colleagues reveal that S. tuberosa tricks hornets into making off with its seeds by making them smell like prey. The seeds release a cocktail of particular hydrocarbon compounds, which stimulate the hornets’ antennae, attracting the insects with the suggestion of a meal for their young.S. tuberosa uses vespicochory – the plant convinces hornets to grab its seeds and fly away with them. The hornets eventually drop the seeds, dispersing them in the process. Gao and his colleagues wanted to find out why the hornets were so eager to attack the seeds and carry them off; what visual, olfactory (smell) or gustatory (taste) cues did the hornets find so alluring?\n\nIn their paper recently published in New Phytologist, Gao and his colleagues reveal that S. tuberosa tricks hornets into making off with its seeds by making them smell like prey. The seeds release a cocktail of particular hydrocarbon compounds, which stimulate the hornets’ antennae, attracting the insects with the suggestion of a meal for their young."
},
  {
  "img": "./assets/images/toronto.jpeg",
  "thumbnail": "./assets/images/toronto-small.jpeg",
  "title": "Prism of Relations: the 2022 Toronto Biennial",
  "shortText": "The second edition of the Toronto Biennial of Art - What Water Knows, The Land Remembers - revisited the history of Toronto to underscore the importance of remembrance. The title What Water Knows, The Land Remembers is a continuation of what began with the first edition, The Shoreline Dilemma, but this time it expanded the horizon to view the city as a living personification of the natural world, indigenous wisdom and colonial history. ",
  "slug": "prism-of-relations-the-toronto-biennial",
  "text": ""
},
  {
  "img": "./assets/images/mexico.jpeg",
  "thumbnail": "./assets/images/mexico-small.jpeg",
  "title": "Mexico's Best-Kept Secret Is Zacatecas’s Vibrant Art Scene",
  "shortText": "It all coalesces to lend the Mexican city of Zacatecas that vital yet mysterious attitude that invites introspection, inspiration, and creation. This being the case, it should come as no surprise that there is an abundance of impressive artistic offerings in this small city in central Mexico. Few outsiders, however, are aware of them.",
  "slug": "mexico-s-best-kept-secret-is-zacatecas-s-vibrant-art-scene",
  "text": "Of the many admirable art museums and galleries throughout Zacatecas, the two named after the Coronel brothers are the most substantial by any metric. Zacatecas-born Pedro and Rafael Coronel were both highly successful and influential artists during their lives, and upon their deaths, their works, along with art they had gathered from all over the world, were collected in a pair of museums that more or less bookend the city’s downtown region.\n\nThe Museo Pedro Coronel houses the largest and most diverse collection in the city, with works by Dalí, Chagall, and Braque. Housed in a building that was constructed in the 17th century, the institution’s space functioned as a college, hospital, military barracks, and prison before being converted into a museum in 1983. In addition to its surprisingly rich modern art holdings, the museum has an expansive collection of ancient and Indigenous art from Mexico, as well as artifacts from China, Japan, Thailand, Greece, Nigeria, Cameroon, the Democratic Republic of Congo, Zimbabwe, and beyond.\n\nThe Museo Rafael Coronel leans heavily into Mexican folk art—its collection of masks is particularly strong. A 16th-century convent that was abandoned for centuries before being restored 40 years ago, the entire place is an architectural delight. In addition to the folk art, you’ll find a substantial collection of the namesake Coronel’s works, as well as an exhibit of pieces by Diego Rivera, who was his father-in-law. Keep an eye out for Coronel’s many statues that depict either wizards, druids, or magicians, depending on who you ask. They add an element of whimsy to the place."
},
  {
  "img": "./assets/images/abstract-painter.jpeg",
  "thumbnail": "./assets/images/abstract-painter-small.jpeg",
  "title": "Mary Obering, Abstract Painter With a Passionate Following, Dies at 85",
  "shortText": "Mary Obering, a painter whose geometric abstractions brought her a small but loyal following, has died at 85. New York’s Bortolami gallery, which added her to its roster in 2019, said that Obering died in New York of natural causes on July 29.",
  "slug": "mary-obering-abstract-painter-with-a-passionate-following-dies-at",
  "text": "Born in 1937 in Shreveport, Louisiana, Obering did not set out to become an artist. She studied experimental psychology as an undergraduate at Harvard University, where she studied under the behaviorist B. F. Skinner. In a 2017 interview with Cultured, Obering noted that she did not recall that period as being entirely divorced from her artistic development, saying, “The scientific approach to life, and its impossibilities, led me to become an artist.”\n\nAfter Harvard, Obering attended the University of Denver, where she received an M.F.A. In 1971, she came to New York at Andre’s urging and remained there for the rest of her career.\n\nAndre curated Obering’s first-ever New York solo show, which was held at Artists Space in 1973. That show exhibited some of her earliest geometric abstractions, which were done using acrylic on canvas and enacted spare, delicate contrasts between hues.\n\nShe went on to figure in the Whitney Biennial two years later and to have shows with Julian Pretto, a dealer with a passion for the Minimalists. She also exhibited with Annina Nosei, a New York dealer known for boosting talents like Jean-Michel Basquiat and David Salle.\n\nFor a while, Obering was considered to be a somewhat obscure figure within New York art history, but in the past few years, she gained new gallery representation, and it helped to widen her audience. The now-defunct Kayne Griffin Corcoran gallery in Los Angeles added her to its roster in 2018, and Bortolami followed the year afterward.\n\nMany of Obering’s abstractions would come to rely on materials more closely associated with art of the Renaissance than contemporary movements. She used gold leaf in her abstractions, worked in encaustic and tempera, and relied upon colors that, for some critics, seemed to recall centuries-old Italian paintings.\n\n“All of this takes a while to register, and its handling is far too deliberate to be transcendent, but it produces an unexpected emotional pull,” critic Holland Cotter wrote of Obering’s work in 1995."
},
  {
  "img": "./assets/images/archeology.jpeg",
  "thumbnail": "./assets/images/archeology-small.jpeg",
  "title": "Archaelogists Discovered 800-Year-Old Ancient Palace That May Have Belonged To Genghis Khan's Grandson",
  "shortText": "Archaelogists discovered the remains of an ancient palace that may have belonged to Genghis Khan’s grandson Hulagu Khan in the Çaldıran district of eastern Turkey’s Van province. Excavations at the site are currently ongoing.",
  "slug": "archaelogists-discovered-year-old-ancient-palace-that-may-have-belonged-to-genghis-khan-s-grandson",
  "text": "Archaelogists discovered the remains of an ancient palace that may have belonged to Genghis Khan’s grandson Hulagu Khan in the Çaldıran district of eastern Turkey’s Van province. Excavations at the site are currently ongoing.\n\nWhile the palace in question has not been definitively identified as a lost Khan residence, the excavation team, led by Ersel Çağlıtütuncigil of the Izmir Katip Çelebi University Turkish-Islamic Archeology Department, unearthed shards of tricolor-glazed ceramics and pottery, porcelain, bricks, and glazed roof tiles.\n\nMunkhtulga Rinchinkhorol, a Mongolian Academy of Sciences archaeologist working on the dig, told Live Science the “‘s’-like symbols on the roof-ending tiles,” also known as the “svastika pattern or tamga,” are “one of the power symbols of the Mongol Khans.” Meanwhile, historical records from the 1260s detail the construction of Hulagu Khan’s summer palace in Çaldıran, but they don’t specify an exact location. It is thought the discovered palace could be this missing residence.Archaelogists discovered the remains of an ancient palace that may have belonged to Genghis Khan’s grandson Hulagu Khan in the Çaldıran district of eastern Turkey’s Van province. Excavations at the site are currently ongoing.\n\nWhile the palace in question has not been definitively identified as a lost Khan residence, the excavation team, led by Ersel Çağlıtütuncigil of the Izmir Katip Çelebi University Turkish-Islamic Archeology Department, unearthed shards of tricolor-glazed ceramics and pottery, porcelain, bricks, and glazed roof tiles.\n\nMunkhtulga Rinchinkhorol, a Mongolian Academy of Sciences archaeologist working on the dig, told Live Science the “‘s’-like symbols on the roof-ending tiles,” also known as the “svastika pattern or tamga,” are “one of the power symbols of the Mongol Khans.” Meanwhile, historical records from the 1260s detail the construction of Hulagu Khan’s summer palace in Çaldıran, but they don’t specify an exact location. It is thought the discovered palace could be this missing residence."
}
]